import {sortEvents} from "src/General/General";

const eventsDefault = [
  {
    "timestamp": 6.160356073346696,
    "duration": 0.8361136523432808,
    "zone": {
      "left": 113.299598661696,
      "top": 195.3639952425215,
      "width": 126.18979937751924,
      "height": 46.23090211142281
    }
  },
  {
    "timestamp": 197.26982485199028,
    "duration": 1.425753180121551,
    "zone": {
      "left": 192.76544477386037,
      "top": 581.4898039540144,
      "width": 106.16620867207996,
      "height": 36.71363072245102
    }
  },
  {
    "timestamp": 311.4137179754054,
    "duration": 0.771621521078985,
    "zone": {
      "left": 336.20538731413893,
      "top": 692.4622709372551,
      "width": 71.27758683613598,
      "height": 14.362711002039037
    }
  },
  {
    "timestamp": 406.2573632771099,
    "duration": 0.7616716297865097,
    "zone": {
      "left": 1027.3366704663963,
      "top": 100.54030465847946,
      "width": 122.39294170631354,
      "height": 28.621699648416232
    }
  },
  {
    "timestamp": 493.5348177482675,
    "duration": 1.4545360324558856,
    "zone": {
      "left": 766.6346973999397,
      "top": 179.4157393344944,
      "width": 140.9759937069946,
      "height": 19.482852451003016
    }
  }
];

const expected = [{
    "timestamp": 6.160356073346696,
    "duration": 0.8361136523432808,
    "zone": {
      "left": 113.299598661696,
      "top": 195.3639952425215,
      "width": 126.18979937751924,
      "height": 46.23090211142281
    },
    "endTime": 6.996469725689977
  }, {
    "timestamp": 197.26982485199028,
    "duration": 1.425753180121551,
    "zone": {
      "left": 192.76544477386037,
      "top": 581.4898039540144,
      "width": 106.16620867207996,
      "height": 36.71363072245102
    },
    "endTime": 198.69557803211183
  }, {
    "timestamp": 311.4137179754054,
    "duration": 0.771621521078985,
    "zone": {
      "left": 336.20538731413893,
      "top": 692.4622709372551,
      "width": 71.27758683613598,
      "height": 14.362711002039037
    },
    "endTime": 312.1853394964844
  }, {
    "timestamp": 406.2573632771099,
    "duration": 0.7616716297865097,
    "zone": {
      "left": 1027.3366704663963,
      "top": 100.54030465847946,
      "width": 122.39294170631354,
      "height": 28.621699648416232
    },
    "endTime": 407.0190349068964
  }, {
    "timestamp": 493.5348177482675,
    "duration": 1.4545360324558856,
    "zone": {
      "left": 766.6346973999397,
      "top": 179.4157393344944,
      "width": 140.9759937069946,
      "height": 19.482852451003016
    },
    "endTime": 494.98935378072343
  }
];

describe('sortEvents', () => {
  test('Функция должна сортировать по значению создания события и добавлять новое свойство дату конец события', () => {
    expect(sortEvents(eventsDefault)).toEqual(expected);
  });

  test('Функция должна возвращать пустой массив при пустых входных данных', () => {
    expect(sortEvents([])).toEqual([]);
  });
});
